<?php
function ProcessRequest($request){

    $p = new stdClass();

    $p->orderss = [
        ["ID" => "440202507", "User" => "یگانه علیزاده", "UserID" => 2, "Shaba" => "IR940150000184370199152881", "Price" => 2500, "Status" => "موفق"],
        ["ID" => "340202507", "User" => "بنفشه ابراهیمی", "UserID" => 3, "Shaba" => "IR940150000555960155252882", "Price" => 5500, "Status" => "رد شده"],
        ["ID" => "540202507", "User" => "نازنین علیزاده", "UserID" => 4, "Shaba" => "IR940150000184370199152883", "Price" => 9900, "Status" => "پرداخت نشده"],
        ["ID" => "440202507", "User" => "یگانه علیزاده", "UserID" => 5, "Shaba" => "IR940150000184370199152881", "Price" => 2500, "Status" => "موفق"],
        ["ID" => "340202507", "User" => "بنفشه ابراهیمی", "UserID" => 6, "Shaba" => "IR940150000555960155252882", "Price" => 5500, "Status" => "رد شده"],
        ["ID" => "540202507", "User" => "نازنین علیزاده", "UserID" => 7, "Shaba" => "IR940150000184370199152883", "Price" => 9900, "Status" => "پرداخت نشده"],
        ["ID" => "440202507", "User" => "یگانه علیزاده", "UserID" => 8, "Shaba" => "IR940150000184370199152881", "Price" => 2500, "Status" => "موفق"],
        ["ID" => "340202507", "User" => "بنفشه ابراهیمی", "UserID" => 9, "Shaba" => "IR940150000555960155252882", "Price" => 5500, "Status" => "رد شده"],
        ["ID" => "540202507", "User" => "نازنین علیزاده", "UserID" => 21, "Shaba" => "IR940150000184370199152883", "Price" => 9900, "Status" => "پرداخت نشده"],
        ["ID" => "440202507", "User" => "یگانه علیزاده", "UserID" => 22, "Shaba" => "IR940150000184370199152881", "Price" => 2500, "Status" => "موفق"],
        ["ID" => "340202507", "User" => "بنفشه ابراهیمی", "UserID" => 23, "Shaba" => "IR940150000555960155252882", "Price" => 5500, "Status" => "رد شده"],
        ["ID" => "540202507", "User" => "نازنین علیزاده", "UserID" => 24, "Shaba" => "IR940150000184370199152883", "Price" => 9900, "Status" => "پرداخت نشده"],
    ];
    
    return [
        'content'   => biiq_Template::Start('orders->index', true, ['Objects' => $p]),
        'id'        => 1,
        'title'     => 'مالی ',
        'Canonical' => SITE.'orders/'
    ];
}
?>